; === オーバーレイ表示テスト用シナリオ ===

[chara_show name="lancelot" pos="center" time=500]
[wait time=500]

lancelot:やぁ、訓練教官を務めるランスロットだ。よろしく。

lancelot:ここでは、ナップサックバトルの基本を学ぶことが出来る。
lanelot:左の箱が君のナップサックで、右の箱が相手のナップサックだ。
lancelot:このナップサックの中にキャラクターをセットしていき、相手の体力を0にするか、タイムアップでより体力が多ければ勝利となる。
lancelot:キャラクターはドラッグで動かせるぞ。
lancelot:また、タップでキャラクターの詳細を、長押しで回転させることが出来る。
lancelot:相手のキャラ詳細も見られるから、よく対策を練ろう。
lancelot:次にナップサックバトルで最も重要なバフを紹介しよう。
lancelot:それが「属性共鳴」と「ヤジルシナジー」だ。
[walk name="lancelot" x=1000]
;[image storage="tutorial_elements]
lancelot:各キャラクターには属性が設定してある。俺なら水属性といった感じだな。
lancelot:そして、同じ属性のキャラクターを3人以上揃えると発動するのが属性共鳴だ！
lancelot:同じ属性のキャラクターは全てこの属性共鳴のバフを受けられるんだ。
lancelot:違う属性、例えばヴェインやパーシヴァルは水の属性共鳴は受けられないんだ。
lancelot:属性共鳴の効果は属性ごとに違うから、説明書を読んでくれ。
;[image storage="tutorial_arrow"]
lancelot:次にヤジルシナジーについて説明しよう。
lancelot:一部のキャラには黄色い矢印が付いていることがある。
lancelot:この矢印の隣にキャラを配置することで、バフを受けられるのが、ヤジルシナジーだ！
lancelit:ヤジルシナジーは必ず矢印に隣接させる必要があるが、属性に縛られない。
lancelot:どのキャラがどんなシナジーなのかは、キャラをタップすれば見られるから、あとで確認してみてくれ！

yuna:「確認できたら、この会話を終了します。」


[chara_hide name="yuna" time=500]
[wait time=500]
[overlay_end]